1m30s/STM32_USB-PD_Power/USBPD/Target/usbpd_dpm_user.c
}

/**
  * @brief  Evaluate received Capabilities Message from Source port and prepare the request message
  * @param  PortNum         Port number
  * @param  PtrRequestData  Pointer on selected request data object
  * @param  PtrPowerObjectType  Pointer on the power data object
  * @retval None
  */
void USBPD_DPM_SNK_EvaluateCapabilities(uint8_t PortNum, uint32_t *PtrRequestData, USBPD_CORE_PDO_Type_TypeDef *PtrPowerObjectType)
{
/* USER CODE BEGIN USBPD_DPM_SNK_EvaluateCapabilities */
	//DPM_USER_DEBUG_TRACE(PortNum, "ADVICE: update USBPD_DPM_SNK_EvaluateCapabilities");
	//USBPD_SNKRDO_TypeDef rdo;

//	uint8_t idx = g_curRequestPDOIndex; // pdo index to be sent
	// Determine PDO index
	uint8_t idx = 0;
	uint8_t i;
	if(IS_PPS_MODE())
	{
		uint16_t maxCurrent = 0;
		for(i=g_receivedFirstAPDOIdx; i<g_receivedPDOSize; i++)
		{
			if(g_receivedPDO[i].GenericPDO.PowerObject == USBPD_CORE_PDO_TYPE_APDO &&
					g_ppsVoltageLevel >= g_receivedPDO[i].SRCSNKAPDO.MinVoltageIn100mV * 100 &&
					g_ppsVoltageLevel <= g_receivedPDO[i].SRCSNKAPDO.MaxVoltageIn100mV * 100)
			{
				if(maxCurrent < g_receivedPDO[i].SRCSNKAPDO.MaxCurrentIn50mAunits)
				{
					maxCurrent = g_receivedPDO[i].SRCSNKAPDO.MaxCurrentIn50mAunits;
					idx = i;
				}
			}
		}

		if(idx < g_receivedFirstAPDOIdx)
		{
			idx = g_receivedFirstAPDOIdx;
			g_ppsVoltageLevel = g_receivedPDO[idx].SRCSNKAPDO.MinVoltageIn100mV * 100;
		}
	}
	else
	{
		uint8_t idx_max = g_receivedFirstAPDOIdx;
		if(idx_max == 0) idx_max = g_receivedPDOSize;
		for(i=0; i<idx_max; i++)
		{
			if(g_fixedVoltageLevel == g_receivedPDO[i].SRCFixedPDO.VoltageIn50mVunits * 50)
			{
				idx = i;
				break;
			}
		}
	}
	if(idx > g_receivedPDOSize) return; // error
	g_curRequestPDOIndex = idx;


	if(g_receivedPDO[idx].GenericPDO.PowerObject == USBPD_CORE_PDO_TYPE_APDO) // index indicates APDO (PPS)
	{
		g_curActiveRDO.d32 = 0; // clear
		g_curActiveRDO.ProgRDO.OutputVoltageIn20mV = g_ppsVoltageLevel / 20;
		g_curActiveRDO.ProgRDO.ObjectPosition = idx + 1;
		g_curActiveRDO.ProgRDO.OperatingCurrentIn50mAunits =
				g_receivedPDO[idx].SRCSNKAPDO.MaxCurrentIn50mAunits;

		*PtrPowerObjectType = USBPD_CORE_PDO_TYPE_APDO;//USBPD_CORE_PDO_TYPE_APDO;
		*PtrRequestData = g_curActiveRDO.d32;
	}
	else // Fixed
	{
		g_curActiveRDO.d32 = 0; // clear
		g_curActiveRDO.FixedVariableRDO.ObjectPosition = idx + 1;
		g_curActiveRDO.FixedVariableRDO.OperatingCurrentIn10mAunits = 50;  // 500mA
		g_curActiveRDO.FixedVariableRDO.MaxOperatingCurrent10mAunits =
				g_receivedPDO[idx].SRCFixedPDO.MaxCurrentIn10mAunits;
		g_curActiveRDO.FixedVariableRDO.CapabilityMismatch = 0;


		*PtrPowerObjectType = USBPD_CORE_PDO_TYPE_FIXED;
		*PtrRequestData = g_curActiveRDO.d32;
	}
	g_dispInfo.rqtVoltage = CurRDO_GetVoltage();
	g_dispInfo.rqtCurrent = CurRDO_GetCurrent();

/* USER CODE END USBPD_DPM_SNK_EvaluateCapabilities */
}

/**
  * @brief  Callback to be used by PE to evaluate a Vconn swap
  * @param  PortNum Port number
  * @retval USBPD_ACCEPT, USBPD_REJECT, USBPD_WAIT
  */
USBPD_StatusTypeDef USBPD_DPM_EvaluateVconnSwap(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_DPM_EvaluateVconnSwap */
  USBPD_StatusTypeDef status = USBPD_REJECT;
  if (USBPD_TRUE == DPM_USER_Settings[PortNum].PE_VconnSwap)
  {
    status = USBPD_ACCEPT;
  }

  return status;
/* USER CODE END USBPD_DPM_EvaluateVconnSwap */
}

/**
  * @brief  Callback to be used by PE to manage VConn
  * @param  PortNum Port number
  * @param  State Enable or Disable VConn on CC lines
  * @retval USBPD_ACCEPT, USBPD_REJECT
  */
USBPD_StatusTypeDef USBPD_DPM_PE_VconnPwr(uint8_t PortNum, USBPD_FunctionalState State)
{
/* USER CODE BEGIN USBPD_DPM_PE_VconnPwr */
  return USBPD_ERROR;
/* USER CODE END USBPD_DPM_PE_VconnPwr */
}

/**
  * @brief  DPM callback to allow PE to forward extended message information.
  * @param  PortNum Port number
  * @param  MsgType Type of message to be handled in DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_EXT_SECURITY_REQUEST Security Request extended message
  *           @arg @ref USBPD_EXT_SECURITY_RESPONSE Security Response extended message
  * @param  ptrData   Pointer on address Extended Message data could be read (u8 pointer)
  * @param  DataSize  Nb of u8 that compose Extended message
  * @retval None
  */
void USBPD_DPM_ExtendedMessageReceived(uint8_t PortNum, USBPD_ExtendedMsg_TypeDef MsgType, uint8_t *ptrData, uint16_t DataSize)
{
/* USER CODE BEGIN USBPD_DPM_ExtendedMessageReceived */

/* USER CODE END USBPD_DPM_ExtendedMessageReceived */
}

/**
  * @brief  DPM callback to allow PE to enter ERROR_RECOVERY state.
  * @param  PortNum Port number
  * @retval None
  */
void USBPD_DPM_EnterErrorRecovery(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_DPM_EnterErrorRecovery */
  /* Inform CAD to enter recovery mode */
  USBPD_CAD_EnterErrorRecovery(PortNum);
/* USER CODE END USBPD_DPM_EnterErrorRecovery */
}

/**
  * @brief  Callback used to ask application the reply status for a DataRoleSwap request
  * @note   if the callback is not set (ie NULL) the stack will automatically reject the request
  * @param  PortNum Port number
  * @retval Returned values are:
            @ref USBPD_ACCEPT if DRS can be accepted
            @ref USBPD_REJECT if DRS is not accepted in one data role (DFP or UFP) or in PD2.0 config
            @ref USBPD_NOTSUPPORTED if DRS is not supported at all by the application (in both data roles) - P3.0 only
  */
USBPD_StatusTypeDef USBPD_DPM_EvaluateDataRoleSwap(uint8_t PortNum)
{
/* USER CODE BEGIN USBPD_DPM_EvaluateDataRoleSwap */
  USBPD_StatusTypeDef status = USBPD_REJECT;
  /* Sent NOT_SUPPORTED if DRS is not supported at all by the application (in both data roles) - P3.0 only */
  if ((USBPD_FALSE == DPM_USER_Settings[PortNum].PE_DataSwap)
    || ((USBPD_FALSE == DPM_USER_Settings[PortNum].PE_DR_Swap_To_DFP)
    && (USBPD_FALSE == DPM_USER_Settings[PortNum].PE_DR_Swap_To_UFP)))
  {
    status = USBPD_NOTSUPPORTED;
  }
  else
  {
    /* ACCEPT DRS if at least supported by 1 data role */
    if (((USBPD_TRUE == DPM_USER_Settings[PortNum].PE_DR_Swap_To_DFP) && (USBPD_PORTDATAROLE_UFP == DPM_Params[PortNum].PE_DataRole))
       || ((USBPD_TRUE == DPM_USER_Settings[PortNum].PE_DR_Swap_To_UFP) && (USBPD_PORTDATAROLE_DFP == DPM_Params[PortNum].PE_DataRole)))
    {
      status = USBPD_ACCEPT;
    }
  }
  return status;
/* USER CODE END USBPD_DPM_EvaluateDataRoleSwap */
}

/**
  * @brief  Callback to be used by PE to check is VBUS is ready or present
  * @param  PortNum Port number
  * @param  Vsafe   Vsafe status based on @ref USBPD_VSAFE_StatusTypeDef
  * @retval USBPD_DISABLE or USBPD_ENABLE
  */
USBPD_FunctionalState USBPD_DPM_IsPowerReady(uint8_t PortNum, USBPD_VSAFE_StatusTypeDef Vsafe)
{
/* USER CODE BEGIN USBPD_DPM_IsPowerReady */
  return ((USBPD_OK == USBPD_PWR_IF_SupplyReady(PortNum, Vsafe)) ? USBPD_ENABLE : USBPD_DISABLE);
/* USER CODE END USBPD_DPM_IsPowerReady */
}

/**
  * @}
  */

/** @defgroup USBPD_USER_EXPORTED_FUNCTIONS_GROUP3 USBPD USER Functions PD messages requests
  * @{
  */

/**
  * @brief  Request the PE to send a hard reset
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestHardReset(uint8_t PortNum)
{
  USBPD_StatusTypeDef _status = USBPD_PE_Request_HardReset(PortNum);
  DPM_USER_ERROR_TRACE(PortNum, _status, "HARD RESET not accepted by the stack");
  return _status;
}

/**
  * @brief  Request the PE to send a cable reset.
  * @note   Only a DFP Shall generate Cable Reset Signaling. A DFP Shall only generate Cable Reset Signaling within an Explicit Contract.
            The DFP has to be supplying VCONN prior to a Cable Reset
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestCableReset(uint8_t PortNum)
{
  USBPD_StatusTypeDef _status = USBPD_PE_Request_CableReset(PortNum);
  DPM_USER_ERROR_TRACE(PortNum, _status, "CABLE RESET not accepted by the stack");
  return _status;
}

/**
  * @brief  Request the PE to send a GOTOMIN message
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestGotoMin(uint8_t PortNum)
{
  USBPD_StatusTypeDef _status = USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_GOTOMIN, USBPD_SOPTYPE_SOP);
  DPM_USER_ERROR_TRACE(PortNum, _status, "GOTOMIN not accepted by the stack");
  return _status;
}

/**
  * @brief  Request the PE to send a PING message
  * @note   In USB-PD stack, only ping management for P3.0 is implemented.
  *         If PD2.0 is used, PING timer needs to be implemented on user side.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestPing(uint8_t PortNum)
{
  USBPD_StatusTypeDef _status = USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_PING, USBPD_SOPTYPE_SOP);
  DPM_USER_ERROR_TRACE(PortNum, _status, "PING not accepted by the stack");
  return _status;
}

/**
  * @brief  Request the PE to send a request message.
  * @param  PortNum     The current port number
  * @param  IndexSrcPDO Index on the selected SRC PDO (value between 1 to 7)
  * @param  RequestedVoltage Requested voltage (in MV and use mainly for APDO)
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestMessageRequest(uint8_t PortNum, uint8_t IndexSrcPDO, uint16_t RequestedVoltage)
{
  USBPD_StatusTypeDef _status = USBPD_ERROR;
/* USER CODE BEGIN USBPD_DPM_RequestMessageRequest */

  // Update ActiveRDO
  {
		uint8_t idx = IndexSrcPDO; // pdo index to be sent
		// fixed or pps
		if(idx > g_receivedPDOSize) return _status; // error


		if(g_receivedPDO[idx].GenericPDO.PowerObject == USBPD_CORE_PDO_TYPE_APDO) // index indicates APDO
		{
			g_curActiveRDO.d32 = 0;
			g_curActiveRDO.ProgRDO.OutputVoltageIn20mV = g_ppsVoltageLevel / 20;
			g_curActiveRDO.ProgRDO.ObjectPosition = idx + 1;
			g_curActiveRDO.ProgRDO.OperatingCurrentIn50mAunits =
					g_receivedPDO[idx].SRCSNKAPDO.MaxCurrentIn50mAunits;

